sensoroptconverged/con/13.5_deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       229317;
    }
    right
    {
        type            patch;
        nFaces          200;
        startFace       229717;
    }
    up
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       229917;
    }
    left
    {
        type            patch;
        nFaces          200;
        startFace       230317;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          114774;
        startFace       230517;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          114774;
        startFace       345291;
    }
    wing
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          445;
        startFace       460065;
    }
)

// ************************************************************************* //
