sensoroptconverged/con/13.5_deg/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom patch;
sourceCase ".";  //Use "." to extrude the current case in situ

sourcePatches (back);
exposedPatchName front;  //Note that here no brackets are needed

extrudeModel  plane;
thickness     0.8;

flipNormals false;
mergeFaces false;
